# Import PANDAS Library

Notice that we are using pd as an abbreviation so each time we want to use the PANDAS library, we can simply type pd instead of pandas.

In [172]:
import pandas as pd

In [173]:
pd.options.display.float_format = '{:,.2f}'.format

# Import Dataset (either full dataset or simplified)

You can use either set of datafiles (full or simplified). In the past some students' computers could not handle the full dataset. If you worry that your computer will not handle the full dataset (or if you find your code is running very slow), use the simplified version. 

The simplified version was created by taking a sample of the full data; hence the simplified files have "Sample" added to the end of the file names. Some files were not large to begin with and didn't need to be reduced. Those files do not have Sample added to the end of the file name.

## Adjust the file address below to match your computer.

You will want to replace the begining of the address below (i.e., everything before OneDrive - Oregon State University/)

In [174]:
begInv = pd.read_csv("BegInvFINAL12312016.csv")

In [175]:
begInv.head(2)

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,startDate
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2016-01-01
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2016-01-01

In [176]:
begInv = begInv.rename(columns = {'onHand':'01_01_2016_Qty'})
begInv.head(2)

,InventoryId,Store,City,Brand,Description,Size,01_01_2016_Qty,Price,startDate
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2016-01-01
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2016-01-01

In [177]:
begInv['InvCost01_01_2016'] = begInv['01_01_2016_Qty'] * begInv['Price']
begInv.head(2)

,InventoryId,Store,City,Brand,Description,Size,01_01_2016_Qty,Price,startDate,InvCost01_01_2016
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2016-01-01,103.92
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2016-01-01,76.93

In [178]:
begInv_Store = begInv[['Store','01_01_2016_Qty','InvCost01_01_2016']].groupby('Store').sum()
begInv_Store.head(2)

       01_01_2016_Qty  InvCost01_01_2016
Store
1               49917         838,079.59
2               52925         840,452.20

# Deliverable 1 a

In [179]:
begInv_Store.sort_values(by='InvCost01_01_2016',ascending=False).head(10)

       01_01_2016_Qty  InvCost01_01_2016
Store
34             153852       3,291,170.24
73             162551       3,142,497.36
67             158996       3,079,578.63
66             149314       2,973,033.90
76             140208       2,952,418.44
69             144255       2,946,726.65
38             114368       2,232,698.77
55             119641       2,001,263.66
50              94720       1,649,808.22
79              95330       1,503,149.48

# The 10 stores listed above are the 10 stores holding the highest $ value of inventory at the start of the year.

# Deliverable 1 b

In [180]:
begInv_Brand = begInv[['Brand','01_01_2016_Qty','InvCost01_01_2016']].groupby('Brand').sum()

In [181]:
begInv_Brand.sort_values(by='InvCost01_01_2016',ascending=False).head(10)

       01_01_2016_Qty  InvCost01_01_2016
Brand
3545            14499         463,823.01
1233            12016         432,455.84
8068            15341         383,371.59
4261            15499         340,823.01
3858            13649         327,439.51
2753             4625         286,703.75
8082             9287         278,517.13
8680             7066         275,503.34
2589             6766         270,572.34
3876            14829         266,773.71

# The 10 brands listed above are the 10 brands holding the highest $ value of inventory at the start of the year.

# Deliverable 2 a

In [182]:
endInv = pd.read_csv("EndInvFINAL12312016.csv")

In [183]:
endInv = endInv.rename(columns = {'onHand':'12_31_2016_Qty'})

In [184]:
endInv['InvCost12_31_2016'] = endInv['12_31_2016_Qty'] * endInv['Price']

In [185]:
endInv_Store = endInv[['Store','12_31_2016_Qty','InvCost12_31_2016']].groupby('Store').sum()

In [186]:
endInv_Store.sort_values(by='InvCost12_31_2016',ascending=False).head(10)

       12_31_2016_Qty  InvCost12_31_2016
Store
50             260717       4,887,260.68
73             164589       3,254,662.81
67             163765       3,076,114.82
34             145829       3,074,616.75
76             143866       2,975,945.18
69             150848       2,968,678.82
66             144579       2,860,504.99
74             166015       2,803,645.13
38             129397       2,463,906.85
55             125584       2,234,836.35

# The 10 stores listed above are the 10 stores with the highest $ value of inventory at the end of the year.

# Deliverable 2 b

In [187]:
endInv_Brand = endInv[['Brand','12_31_2016_Qty','InvCost12_31_2016']].groupby('Brand').sum()

In [188]:
endInv_Brand.sort_values(by='InvCost12_31_2016',ascending=False).head(10)

       12_31_2016_Qty  InvCost12_31_2016
Brand
1233            15047         526,494.53
3545            16770         502,932.30
2753             7849         470,861.51
8068            15608         366,631.92
3405            12268         355,649.32
4261            16769         351,981.31
2757            11603         336,370.97
2589             7922         300,956.78
1376            13180         276,648.20
2585            10487         272,557.13

# The 10 Brands listed above are the 10 Brands with the highest $ value of inventory at the end of the year.

# Deliverable 3

In [189]:
MergeInv= pd.merge(left=begInv[['InventoryId','01_01_2016_Qty','InvCost01_01_2016']], right=endInv[['InventoryId','12_31_2016_Qty','InvCost12_31_2016']],how='outer',on=['InventoryId'])

In [190]:
MergeInv.head(10)

,InventoryId,01_01_2016_Qty,InvCost01_01_2016,12_31_2016_Qty,InvCost12_31_2016
0,1_HARDERSFIELD_58,8.00,103.92,11.00,142.89
1,1_HARDERSFIELD_60,7.00,76.93,NaN,NaN
2,1_HARDERSFIELD_62,6.00,221.94,7.00,258.93
3,1_HARDERSFIELD_63,3.00,116.97,7.00,272.93
4,1_HARDERSFIELD_72,6.00,209.94,4.00,139.96
5,1_HARDERSFIELD_75,18.00,269.82,7.00,104.93
6,1_HARDERSFIELD_77,7.00,104.93,18.00,269.82
7,1_HARDERSFIELD_79,2.00,29.98,7.00,104.93
8,1_HARDERSFIELD_115,5.00,139.95,35.00,979.65
9,1_HARDERSFIELD_120,11.00,153.89,NaN,NaN

# The above Dataframe shows the beg and end inventory balances in terms of both quantity and total $ value held for each InventoryId.

# Deliverable 4a

In [191]:
PurchaseData = pd.read_csv("PurchasesFINAL12312016.csv")

In [192]:
PurchaseData.head()

,InventoryId,Store,Brand,Description,Size,VendorNumber,VendorName,PONumber,PODate,ReceivingDate,InvoiceDate,PayDate,PurchasePrice,Quantity,Dollars,Classification
0,69_MOUNTMEND_8412,69,8412,Tequila Ocho Plata Fresno,750mL,105,ALTAMAR BRANDS LLC,8124,2015-12-21,2016-01-02,2016-01-04,2016-02-16,35.71,6,214.26,1
1,30_CULCHETH_5255,30,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-01,2016-01-07,2016-02-21,9.35,4,37.40,1
2,34_PITMERDEN_5215,34,5215,TGI Fridays Long Island Iced,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-02,2016-01-07,2016-02-21,9.41,5,47.05,1
3,1_HARDERSFIELD_5255,1,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-01,2016-01-07,2016-02-21,9.35,6,56.10,1
4,76_DONCASTER_2034,76,2034,Glendalough Double Barrel,750mL,388,ATLANTIC IMPORTING COMPANY,8169,2015-12-24,2016-01-02,2016-01-09,2016-02-16,21.32,5,106.60,1

In [193]:
VSold = PurchaseData[['VendorName','Dollars']].groupby('VendorName').sum()

In [194]:
VSold.sort_values(by='Dollars',ascending=False).head(10)

                                  Dollars
VendorName
DIAGEO NORTH AMERICA INC    50,959,796.85
MARTIGNETTI COMPANIES       27,821,473.91
JIM BEAM BRANDS COMPANY     24,203,151.05
PERNOD RICARD USA           24,124,091.56
BACARDI USA INC             17,624,378.72
CONSTELLATION BRANDS INC    15,573,917.90
BROWN-FORMAN CORP           13,529,433.08
ULTRA BEVERAGE COMPANY LLP  13,210,613.93
E & J GALLO WINERY          12,289,608.09
M S WALKER INC              10,935,817.30

# The above Dataframe shows the top 10 Vendors who sold Bibtor the most inventory in total $ during 2016.

# Deliverable 4 b

In [195]:
InvoiceData = pd.read_csv("InvoicePurchases12312016.csv")

In [196]:
InvoiceData.head()

,VendorNumber,VendorName,InvoiceDate,PONumber,PODate,PayDate,Quantity,Dollars,Freight,Approval
0,105,ALTAMAR BRANDS LLC,2016-01-04,8124,2015-12-21,2016-02-16,6,214.26,3.47,NaN
1,4466,AMERICAN VINTAGE BEVERAGE,2016-01-07,8137,2015-12-22,2016-02-21,15,140.55,8.57,NaN
2,388,ATLANTIC IMPORTING COMPANY,2016-01-09,8169,2015-12-24,2016-02-16,5,106.60,4.61,NaN
3,480,BACARDI USA INC,2016-01-12,8106,2015-12-20,2016-02-05,10100,"137,483.78","2,935.20",NaN
4,516,BANFI PRODUCTS CORP,2016-01-07,8170,2015-12-24,2016-02-12,1935,"15,527.25",429.20,NaN

In [197]:
VCharged = InvoiceData[['VendorName','Freight']].groupby('VendorName').sum()

In [198]:
VCharged.sort_values(by='Freight',ascending=False).head(10)

                               Freight
VendorName
DIAGEO NORTH AMERICA INC    257,032.07
MARTIGNETTI COMPANIES       144,719.92
JIM BEAM BRANDS COMPANY     123,880.97
PERNOD RICARD USA           123,780.22
BACARDI USA INC              89,286.27
CONSTELLATION BRANDS INC     79,528.99
BROWN-FORMAN CORP            68,601.68
ULTRA BEVERAGE COMPANY LLP   68,054.70
E & J GALLO WINERY           61,966.91
M S WALKER INC               55,551.82

# The above Dataframe shows the top 10 Vendors who charged Bibtor the most Freight in total $ during 2016.

# Deliverable 4 c

In [199]:
total_purchase_amount = InvoiceData.groupby('VendorName')['Dollars'].sum()
filtered_total_purchase_amount = total_purchase_amount[total_purchase_amount >= 250000]

In [200]:
freight_per_dollar = InvoiceData.groupby('VendorName').apply(lambda x: x['Freight'].sum() / x['Dollars'].sum())

In [201]:
top_10_vendors = freight_per_dollar.sort_values(ascending=False).head(10)
bottom_5_vendors = freight_per_dollar.sort_values(ascending=True).head(5)

In [202]:
D4C = pd.concat([top_10_vendors, bottom_5_vendors], axis=0)

In [203]:
print(D4C)

VendorName
TALL SHIP DISTILLERY LLC      0.01
WESTERN SPIRITS BEVERAGE CO   0.01
HIGHLAND WINE MERCHANTS LLC   0.01
ALTAMAR BRANDS LLC            0.01
DIAGEO CHATEAU ESTATE WINES   0.01
CANDIA VINEYARDS              0.01
LABELLE VYDS AND WINERY       0.01
FLAVOR ESSENCE INC            0.01
TRUETT HURST                  0.01
Russian Standard Vodka        0.01
AAPER ALCOHOL & CHEMICAL CO   0.00
LOYAL DOG WINERY              0.00
SILVER MOUNTAIN CIDERS        0.00
FANTASY FINE WINES CORP       0.00
ADAMBA IMPORTS INTL INC       0.00
dtype: float64

# The above is a list of the top 10 and bottom 5 vendors who sold at least $250,000 to Bibitor in terms of cost of Freight per Dollar purchased.

# Deliverable 4d

In [204]:
high_freight = InvoiceData[(InvoiceData['Freight'] > 100) & (InvoiceData['Quantity'] <= 1000)]

In [205]:
high_freight[['VendorName', 'Freight']].sort_values('Freight', ascending=False).head(10)

                      VendorName  Freight
71   STOLI GROUP,(USA) LLC         349.02
59   REMY COINTREAU USA INC        348.07
69       STATE WINE & SPIRITS      303.70
50   PALM BAY INTERNATIONAL INC    242.73
407  EDRINGTON AMERICAS            219.65
23   EDRINGTON AMERICAS            218.18
40   MAJESTIC FINE WINES           218.05
28   HEAVEN HILL DISTILLERIES      200.02
38   LUXCO INC                     196.61
34   KOBRAND CORPORATION           185.93

# The above data frame displays the Vendors who had the highest freight cost to Bibitor where the quantity purchased was equal to or less than 1,000 units.

# Deliverable 4e

In [206]:
high_freight_copy = high_freight.copy()

In [207]:
high_freight_copy.loc[:, 'Freight per $'] = high_freight_copy['Freight'] / high_freight_copy['Dollars']
high_freight_copy.loc[:, 'Freight per unit'] = high_freight_copy['Freight'] / high_freight_copy['Quantity']

In [208]:
result = high_freight_copy[['VendorName', 'Freight per $', 'Freight per unit']]
print(result.head(10))

                     VendorName  Freight per $  Freight per unit
11  CASTLE BRANDS CORP.                   0.03              0.56
16  DELICATO VINEYARDS INC                0.02              0.16
19  DISARONNO INTERNATIONAL LLC           0.04              0.38
23  EDRINGTON AMERICAS                    0.04              1.60
28  HEAVEN HILL DISTILLERIES              0.03              0.24
34  KOBRAND CORPORATION                   0.03              0.44
38  LUXCO INC                             0.03              0.24
40  MAJESTIC FINE WINES                   0.03              0.25
45  MHW LTD                               0.04              0.43
50  PALM BAY INTERNATIONAL INC            0.04              0.34

# the above data frame Calculate the freight per $ & per unit for those transactions in d. They compare to my findings in 4c above in that they are not the same. 4c had much lower freight by dollar ratios.

# Deliverable 5

In [209]:
zales = pd.read_csv('SalesFINAL12312016.csv')

In [212]:
sales_dollars_sum = zales['SalesDollars'].sum()
sales_df = pd.DataFrame({'Total SalesDollars': [sales_dollars_sum]})

In [214]:
print(sales_df)

   Total SalesDollars
0      452,062,952.02

# The above shows the total sales revenue earned by BiBitor during the 2016 year. This total includes sales from all stores including all brands and products.